# Pandas

- pandas works with heterogenous  data structure  ( serres and dataframe)

df - have tables of data and are ordered, named(columns and rows)

In [2]:
import pandas as pd


data = {
    'towns':['Simat','kipkenyo','turbo','Chemalal'],
    'year':[2002,2022,2001,2007],
    'population' : [300,200,400,200]
}

df = pd.DataFrame(data)

df

      towns  year  population
0     Simat  2002         300
1  kipkenyo  2022         200
2     turbo  2001         400
3  Chemalal  2007         200

In [3]:
# to get results for atleast 5 columns (tail)

df.tail()

      towns  year  population
0     Simat  2002         300
1  kipkenyo  2022         200
2     turbo  2001         400
3  Chemalal  2007         200

In [9]:
# rearaing the columns or extra column

df = pd.DataFrame(data, columns=['year','population','towns','debt'])

df

   year  population     towns debt
0  2002         300     Simat  NaN
1  2022         200  kipkenyo  NaN
2  2001         400     turbo  NaN
3  2007         200  Chemalal  NaN

In [10]:
# data retrival 

df['year']

0    2002
1    2022
2    2001
3    2007
Name: year, dtype: int64